In [78]:
import pandas as pd

In [79]:
df=pd.read_csv("Dataset.csv")

In [80]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021e,EN,FT,Data Science Consultant,54000,EUR,64369,DE,50,DE,L
1,2020,SE,FT,Data Scientist,60000,EUR,68428,GR,100,US,L
2,2021e,EX,FT,Head of Data Science,85000,USD,85000,RU,0,RU,M
3,2021e,EX,FT,Head of Data,230000,USD,230000,RU,50,RU,L
4,2021e,EN,FT,Machine Learning Engineer,125000,USD,125000,US,100,US,S
...,...,...,...,...,...,...,...,...,...,...,...
240,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
241,2021e,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
242,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
243,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
244,2021e,SE,FT,Data Science Manager,7000000,INR,94917,IN,50,IN,L

In [81]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [82]:
 df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [83]:
 df=df.drop(['salary', 'salary_currency'],axis=1)

In [84]:

df

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021e,EN,FT,Data Science Consultant,64369,DE,50,DE,L
1,2020,SE,FT,Data Scientist,68428,GR,100,US,L
2,2021e,EX,FT,Head of Data Science,85000,RU,0,RU,M
3,2021e,EX,FT,Head of Data,230000,RU,50,RU,L
4,2021e,EN,FT,Machine Learning Engineer,125000,US,100,US,S
...,...,...,...,...,...,...,...,...,...
240,2020,SE,FT,Data Scientist,412000,US,100,US,L
241,2021e,MI,FT,Principal Data Scientist,151000,US,100,US,L
242,2020,EN,FT,Data Scientist,105000,US,100,US,S
243,2020,EN,CT,Business Data Analyst,100000,US,100,US,L
244,2021e,SE,FT,Data Science Manager,94917,IN,50,IN,L

In [85]:
df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021e,EN,FT,Data Science Consultant,64369,DE,50,DE,L
1,2020,SE,FT,Data Scientist,68428,GR,100,US,L
2,2021e,EX,FT,Head of Data Science,85000,RU,0,RU,M
3,2021e,EX,FT,Head of Data,230000,RU,50,RU,L
4,2021e,EN,FT,Machine Learning Engineer,125000,US,100,US,S

In [86]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary_in_usd', 'employee_residence', 'remote_ratio',
       'company_location', 'company_size'],
      dtype='object')

In [88]:
# Convert entire column to string type first
df['work_year'] = df['work_year'].astype(str)

# Now extract 4 digit year number using correct regex
df['work_year'] = df['work_year'].str.extract(r'(\d{4})')

# Convert extracted values to numeric, coercing errors to NaN
df['work_year'] = pd.to_numeric(df['work_year'], errors='coerce')

# Fill NaN with the most frequent year (mode)
df['work_year'] = df['work_year'].fillna(df['work_year'].mode()[0]).astype(int)

print(df['work_year'].dtype)  # should be int64 now
print(df['work_year'].unique())  # check final unique values

int32
[2021 2020]

In [89]:
print(df.dtypes)

work_year              int32
experience_level      object
employment_type       object
job_title             object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [91]:

 from sklearn.preprocessing import LabelEncoder

# Label encode ordinal columns
for col in ['experience_level', 'company_size', 'job_title']:
    le = LabelEncoder()
    df[col] = le.fit_transform(df[col])

# One-hot encode nominal columns
df = pd.get_dummies(df, columns=['employment_type', 'employee_residence', 'company_location'], drop_first=True)

In [92]:
# Split the dataset into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.2, random_state=42
)

In [93]:
from sklearn.ensemble import RandomForestRegressor, GradientBoostingRegressor, VotingRegressor
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score
import joblib

In [94]:
rf = RandomForestRegressor(random_state=42, n_estimators=100)
gb = GradientBoostingRegressor(random_state=42, n_estimators=100)

In [95]:
# Create Voting Regressor with both models
voting_regressor = VotingRegressor(estimators=[
    ('rf', rf),
    ('gb', gb)
])

# Train Voting Regressor
voting_regressor.fit(X_train, y_train)

# Predict on test set
y_pred = voting_regressor.predict(X_test)

In [96]:
print('Mean Absolute Error:', mean_absolute_error(y_test, y_pred))
print('Mean Squared Error:', mean_squared_error(y_test, y_pred))
print('R2 Score:', r2_score(y_test, y_pred))

Mean Absolute Error: 13807.429419264841
Mean Squared Error: 702170616.141371
R2 Score: 0.8918965367796229

In [97]:
import joblib
joblib.dump(voting_regressor, 'salary_voting_model.pkl')

['salary_voting_model.pkl']